# 6.	Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

num = int(input("Введите номер буквы латинского алфавита: "))
print(chr(num + 96))
